00_flowInPipe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    ambil_pressure
{
    type    fieldValueDelta;
    libs    ("libfieldFunctionObjects.so");
    operation   subtract;

    region1
    {
        type        surfaceFieldValue;
        operation   average;
        fields      (p);
        writeFields no;
        regionType  patch;
        name        inlet;
    }

    region2
    {
        type        surfaceFieldValue;
        operation   average;
        fields      (p);
        writeFields no;
        regionType  patch;
        name        outlet;
    }
 
    
}

}

// ************************************************************************* //
