00_flowInPipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


3
(
inlet
{
    type patch;
    nFaces 324;
    startFace 538367;
}

outlet
{
    type patch;
    nFaces 1056;
    startFace 538691;
}

dinding_aja
{
    type wall;
    nFaces 24970;
    startFace 539747;
}

)


// ************************************************************************* //
